---
kind: method
id: M:Autodesk.Revit.DB.Analysis.GenericZone.GetBoundaries
source: html/38211d94-39af-ccfb-5fbb-037b7de5315e.htm
---
# Autodesk.Revit.DB.Analysis.GenericZone.GetBoundaries Method

Gets the boundaries for the generic zone.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetBoundaries()
```

## Returns
The generic zone boundaries.